In [1]:
import numpy as np
import pandas as pd

In [7]:
dict1={
    "name":["vaishnavi","Prathyarthi","kiran","Bharathi"],
    "marks":[34,56,78,0],
    "city":["Kolkata","Mumbai","Chennai","Rampura"]
}

In [3]:
dict1

{'name': ['vaishnavi', 'Prathyarthi', 'kiran', 'Bharathi'],
 'marks': [34, 56, 78],
 'city': ['Kolkata', 'Mumbai', 'Chennai', 'Rampura']}

In [8]:
df=pd.DataFrame(dict1)

In [9]:
df

          name  marks     city
0    vaishnavi     34  Kolkata
1  Prathyarthi     56   Mumbai
2        kiran     78  Chennai
3     Bharathi      0  Rampura

In [11]:
df.to_csv("Friends.csv")

In [12]:
df.to_csv("Friends_index.csv",index=False)

In [13]:
df.head(2)

          name  marks     city
0    vaishnavi     34  Kolkata
1  Prathyarthi     56   Mumbai

In [14]:
df.tail(2)

       name  marks     city
2     kiran     78  Chennai
3  Bharathi      0  Rampura

In [15]:
df.describe()

         marks
count   4.0000
mean   42.0000
std    33.2666
min     0.0000
25%    25.5000
50%    45.0000
75%    61.5000
max    78.0000

In [16]:
vaish=pd.read_csv("Friends.csv")

In [17]:
vaish

   Unnamed: 0         name  marks     city
0           0    vaishnavi     34  Kolkata
1           1  Prathyarthi     56   Mumbai
2           2        kiran     78  Chennai
3           3     Bharathi      0  Rampura

In [18]:
vaish["marks"][3]

0

In [19]:
vaish["name"][2]

'kiran'

In [20]:
vaish["name"][2]="Kishore"

C:\Users\vaish\AppData\Local\Temp\ipykernel_20984\2618029238.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vaish["name"][2]="Kishore"

In [21]:
vaish

   Unnamed: 0         name  marks     city
0           0    vaishnavi     34  Kolkata
1           1  Prathyarthi     56   Mumbai
2           2      Kishore     78  Chennai
3           3     Bharathi      0  Rampura

In [22]:
vaish.index=['a','b','c','d']

In [28]:
vaish

   Unnamed: 0         name  marks     city
a           0    vaishnavi     34  Kolkata
b           1  Prathyarthi     56   Mumbai
c           2      Kishore     78  Chennai
d           3     Bharathi      0  Rampura

Series is a data structure in pandas , wen u give data it v ll make and series nd store it

In [29]:
ser=pd.Series(np.random.rand(36))

In [30]:
type(ser)

pandas.core.series.Series

In [31]:
ser

0     0.363243
1     0.429317
2     0.147085
3     0.970836
4     0.359376
5     0.252472
6     0.369790
7     0.331912
8     0.215872
9     0.165177
10    0.447324
11    0.574849
12    0.750047
13    0.577361
14    0.450417
15    0.385010
16    0.191290
17    0.173954
18    0.783427
19    0.024761
20    0.470844
21    0.172921
22    0.741047
23    0.206159
24    0.837381
25    0.188483
26    0.803828
27    0.556461
28    0.140107
29    0.322754
30    0.470463
31    0.240022
32    0.399747
33    0.137254
34    0.546584
35    0.060278
dtype: float64

In [34]:
newdf=pd.DataFrame(np.random.randn(334,5),index=np.arange(334))

In [35]:
newdf

            0         1         2         3         4
0    0.759486  0.125970  1.381771  0.067031 -0.063502
1   -1.078297 -0.226563  1.548660 -0.744822  1.219025
2    1.522011  0.362544 -1.134161 -2.237881  0.695436
3   -1.615695 -0.542201 -0.959542  0.815509 -0.035562
4   -1.071682 -1.656209  1.395331  0.189394  2.265449
..        ...       ...       ...       ...       ...
329  1.565215  2.942341  1.567243 -1.612987 -0.688493
330 -0.810758  0.575572  1.645722 -1.215276 -0.850154
331  2.497891 -0.361384 -1.369214  0.631368  0.055496
332 -1.990923  0.508848 -0.202778 -0.184761  1.081045
333  1.184133  0.694406 -0.031188  0.685008  0.049975

[334 rows x 5 columns]

In [36]:
newdf.head()

          0         1         2         3         4
0  0.759486  0.125970  1.381771  0.067031 -0.063502
1 -1.078297 -0.226563  1.548660 -0.744822  1.219025
2  1.522011  0.362544 -1.134161 -2.237881  0.695436
3 -1.615695 -0.542201 -0.959542  0.815509 -0.035562
4 -1.071682 -1.656209  1.395331  0.189394  2.265449

In [37]:
type(newdf)

pandas.core.frame.DataFrame

WHAT? is the difference between Series and a DataFrame

In [38]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.097859    0.046789   -0.011317   -0.056579    0.025820
std      1.000338    0.978938    0.994297    1.050611    0.993828
min     -2.565253   -3.868619   -2.844266   -3.483783   -2.564404
25%     -0.659163   -0.607692   -0.728207   -0.720052   -0.619355
50%      0.084738    0.067892    0.090424   -0.063719    0.030399
75%      0.820838    0.630595    0.712767    0.615377    0.694899
max      2.848318    2.942341    3.143289    3.086293    2.824346

In [54]:
newdf=pd.DataFrame(np.random.randn(334,5),index=np.arange(334))

In [55]:
newdf

            0         1         2         3         4
0    0.462235 -2.491634 -0.741976 -0.538931  1.204481
1   -1.440647  0.042219 -0.691365 -1.035839 -0.236952
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
3   -2.188940  2.006235  0.144260 -1.089131  1.865385
4    0.275971 -1.960533  0.565052  0.248398  0.459878
..        ...       ...       ...       ...       ...
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

[334 rows x 5 columns]

In [56]:
newdf[0][0]="vaish"

C:\Users\vaish\AppData\Local\Temp\ipykernel_20984\2879483040.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'vaish' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="vaish"

In [57]:
newdf

            0         1         2         3         4
0       vaish -2.491634 -0.741976 -0.538931  1.204481
1   -1.440647  0.042219 -0.691365 -1.035839 -0.236952
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
3    -2.18894  2.006235  0.144260 -1.089131  1.865385
4    0.275971 -1.960533  0.565052  0.248398  0.459878
..        ...       ...       ...       ...       ...
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

[334 rows x 5 columns]

In [59]:
newdf.dtypes#0 index is object becoz v changed it to string other all are float

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [60]:
newdf.head()

          0         1         2         3         4
0     vaish -2.491634 -0.741976 -0.538931  1.204481
1 -1.440647  0.042219 -0.691365 -1.035839 -0.236952
2  2.062585  2.126278  1.890978 -1.168606 -1.339681
3  -2.18894  2.006235  0.144260 -1.089131  1.865385
4  0.275971 -1.960533  0.565052  0.248398  0.459878

In [61]:
newdf.tail()

            0         1         2         3         4
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

In [62]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [63]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [64]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [66]:
newdf.rpow

<bound method DataFrame.rpow of             0         1         2         3         4
0       vaish -2.491634 -0.741976 -0.538931  1.204481
1   -1.440647  0.042219 -0.691365 -1.035839 -0.236952
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
3    -2.18894  2.006235  0.144260 -1.089131  1.865385
4    0.275971 -1.960533  0.565052  0.248398  0.459878
..        ...       ...       ...       ...       ...
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

[334 rows x 5 columns]>

Coverting Dataframe to numpy array

In [67]:
newdf.to_numpy()

array([['vaish', -2.4916337413232417, -0.7419761091885306,
        -0.5389310358657149, 1.2044812750474876],
       [-1.4406468107887132, 0.042219214033133765, -0.6913646547566556,
        -1.035838881127542, -0.23695222048308948],
       [2.0625846903999547, 2.126278379106034, 1.8909781875484466,
        -1.1686056565619949, -1.339681088734066],
       ...,
       [-2.310328104234599, -1.1002932941473236, 1.1938164886970635,
        1.314350311331807, 1.1336590538485156],
       [-0.9103908556957283, 1.21593350068226, 0.9137010060210231,
        1.1377898265787803, 0.28919371662018284],
       [-0.4240272851590597, -1.3446865601580091, -0.6013633974155259,
        -0.4194137126804587, -1.0413860233002008]], dtype=object)

In [68]:
# U want to change sumthg then 
newdf[0][1]=5

In [69]:
newdf

            0         1         2         3         4
0       vaish -2.491634 -0.741976 -0.538931  1.204481
1           5  0.042219 -0.691365 -1.035839 -0.236952
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
3    -2.18894  2.006235  0.144260 -1.089131  1.865385
4    0.275971 -1.960533  0.565052  0.248398  0.459878
..        ...       ...       ...       ...       ...
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

[334 rows x 5 columns]

In [70]:
newdf[0][0]=7

In [1]:
newdf

NameError: name 'newdf' is not defined

In [73]:
newdf.T#rows to columns and viceversa

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,7,5,2.062585,-2.18894,0.275971,-1.569983,0.04422,1.399636,-0.864521,0.775517,...,-0.154951,0.905088,0.972633,0.410445,0.804035,0.491701,-0.157808,-2.310328,-0.910391,-0.424027
1,-2.491634,0.042219,2.126278,2.006235,-1.960533,-1.546343,0.458127,0.79216,-0.385095,-1.201409,...,0.714562,-0.961179,0.482484,-2.592449,-0.520028,0.520316,-0.224523,-1.100293,1.215934,-1.344687
2,-0.741976,-0.691365,1.890978,0.14426,0.565052,-0.697388,1.5049,2.366619,-1.008781,-0.106363,...,0.263382,-0.365793,-0.324967,0.828125,1.00999,0.511748,0.073483,1.193816,0.913701,-0.601363
3,-0.538931,-1.035839,-1.168606,-1.089131,0.248398,0.407086,-0.297199,-0.47983,0.466677,-0.425477,...,-1.473003,-1.100513,0.191971,-0.001062,-0.830172,-0.015481,1.646694,1.31435,1.13779,-0.419414
4,1.204481,-0.236952,-1.339681,1.865385,0.459878,-1.685498,1.797189,-0.439765,1.133623,-0.888932,...,-0.340394,0.611544,-0.180514,1.012068,-0.110579,-1.226909,-1.412594,1.133659,0.289194,-1.041386

In [74]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0           7 -2.491634 -0.741976 -0.538931  1.204481
1           5  0.042219 -0.691365 -1.035839 -0.236952
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
3    -2.18894  2.006235  0.144260 -1.089131  1.865385
4    0.275971 -1.960533  0.565052  0.248398  0.459878
..        ...       ...       ...       ...       ...
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
332 -0.910391  1.215934  0.913701  1.137790  0.289194
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386

[334 rows x 5 columns]

In [75]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333 -0.424027 -1.344687 -0.601363 -0.419414 -1.041386
332 -0.910391  1.215934  0.913701  1.137790  0.289194
331 -2.310328 -1.100293  1.193816  1.314350  1.133659
330 -0.157808 -0.224523  0.073483  1.646694 -1.412594
329  0.491701  0.520316  0.511748 -0.015481 -1.226909
..        ...       ...       ...       ...       ...
4    0.275971 -1.960533  0.565052  0.248398  0.459878
3    -2.18894  2.006235  0.144260 -1.089131  1.865385
2    2.062585  2.126278  1.890978 -1.168606 -1.339681
1           5  0.042219 -0.691365 -1.035839 -0.236952
0           7 -2.491634 -0.741976 -0.538931  1.204481

[334 rows x 5 columns]

In [1]:
newdf.sort_index(axis=1,ascending=False)#aorting ulta

NameError: name 'newdf' is not defined

In [2]:
newdf.head()

NameError: name 'newdf' is not defined

In [78]:
#To get one column
newdf[0]

0             7
1             5
2      2.062585
3      -2.18894
4      0.275971
         ...
329    0.491701
330   -0.157808
331   -2.310328
332   -0.910391
333   -0.424027
Name: 0, Length: 334, dtype: object

In [3]:
type(newdf[0])

NameError: name 'newdf' is not defined

In [4]:
import pandas as pd
import numpy as np
newdf1=pd.DataFrame(np.random.randn(334,5),index=np.arange(334))

In [6]:
newdf1

            0         1         2         3         4
0    1.523938  1.975195  0.361525  1.231264  0.971751
1   -0.185538  1.150623 -0.802431  0.129389  0.847630
2   -0.041005  0.792139  0.444280  0.799887  0.811367
3    0.693879  1.370991 -0.629071  0.036340  1.119635
4   -0.183872 -1.044371  1.130194 -0.747252  0.718424
..        ...       ...       ...       ...       ...
329 -0.235624 -1.096214 -0.286869 -1.406716  0.032991
330 -1.241192 -0.034329 -0.719632 -2.037884  0.061355
331 -0.241716 -1.593651  0.077649 -0.470016 -0.942002
332 -0.059928  0.231316  0.936044  0.408868 -0.806767
333  0.183009 -1.253140 -0.010703 -0.297425  1.103451

[334 rows x 5 columns]

In [7]:
type(newdf1[1])

pandas.core.series.Series

In [8]:
newdf2=newdf1

In [9]:
newdf1[0][1]=78654

In [2]:
newdf2

NameError: name 'newdf2' is not defined